Revit 2024 API
ThermalAsset.VaporPressure Property
 The vapor pressure of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double VaporPressure { get; set; }
Visual Basic
Public Property VaporPressure As Double
	Get
	Set
Visual C++
public:
property double VaporPressure {
	double get ();
	void set (double value);
}
Remarks
 Values are in kilograms per feet, squared-second (kg/(ft · s²)) and must be non-negative.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for vaporPressure must be non-negative.
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace